Xelus22/ChibiOS-Contrib/os/hal/ports/AT32/AT32F403Axx/hal_lld.h
/*
    Copyright (C) 2022 Harrison Chan

    Licensed under the Apache License, Version 2.0 (the "License");
    you may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    AT32F403Axx/hal_lld.h
 * @brief   AT32F403Axx HAL subsystem low level driver header.
 *
 * @addtogroup HAL
 * @{
 */

#ifndef _HAL_LLD_H_
#define _HAL_LLD_H_

#include "at32_registry.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Platform identification
 * @{
 */
#if defined(__DOXYGEN__)
#define PLATFORM_NAME           "AT32F403Axx"

#elif defined(AT32F403xC)
#define PLATFORM_NAME           "AT32F403AxC"

#elif defined(AT32F403xE)
#define PLATFORM_NAME           "AT32F403AxE"

#elif defined(AT32F403xG)
#define PLATFORM_NAME           "AT32F403AxG"

#else
#error "unsupported or unrecognized AT32F403Axx member"
#endif

/**
 * @brief   Sub-family identifier.
 */
#if !defined(AT32F403Axx) || defined(__DOXYGEN__)
#define AT32F403Axx
#endif
/** @} */


/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    Absolute Maximum Ratings
 * @{
 */
/**
 * @brief   Maximum system clock frequency.
 */
#define AT32_SYSCLK_MAX        240000000

/**
 * @brief   Maximum HSE clock frequency.
 */
#define AT32_HSECLK_MAX        25000000

/**
 * @brief   Minimum HSE clock frequency.
 */
#define AT32_HSECLK_MIN        4000000

/**
 * @brief   Maximum LSE clock frequency.
 */
#define AT32_LSECLK_MAX        1000000

/**
 * @brief   Minimum LSE clock frequency.
 */
#define AT32_LSECLK_MIN        32768

/**
 * @brief   Maximum PLLs input clock frequency. - AHBCLK
 */
#define AT32_PLLIN_MAX         240000000

/**
 * @brief   Minimum PLLs input clock frequency. - AHBCLK
 */
#define AT32_PLLIN_MIN         4000000

/**
 * @brief   Maximum PLL output clock frequency. - SCLK
 */
#define AT32_PLLOUT_MAX        240000000

/**
 * @brief   Minimum PLL output clock frequency. - SCLK
 */
#define AT32_PLLOUT_MIN        4000000

/**
 * @brief   Maximum APB1 clock frequency.
 */
#define AT32_PCLK1_MAX         120000000

/**
 * @brief   Maximum APB2 clock frequency.
 */
#define AT32_PCLK2_MAX         120000000

/**
 * @brief   Maximum ADC clock frequency.
 */
#define AT32_ADCCLK_MAX        28000000
/** @} */

/**
 * @name    RCC_CFGR register bits definitions - RCC_CFG
 * @{
 */
#define AT32_SW_HSI            (0 << 0)    /**< SYSCLK source is HSI.      */
#define AT32_SW_HSE            (1 << 0)    /**< SYSCLK source is HSE.      */
#define AT32_SW_PLL            (2 << 0)    /**< SYSCLK source is PLL.      */

#define AT32_HPRE_DIV1         (0 << 4)    /**< SYSCLK divided by 1.       */
#define AT32_HPRE_DIV2         (8 << 4)    /**< SYSCLK divided by 2.       */
#define AT32_HPRE_DIV4         (9 << 4)    /**< SYSCLK divided by 4.       */
#define AT32_HPRE_DIV8         (10 << 4)   /**< SYSCLK divided by 8.       */
#define AT32_HPRE_DIV16        (11 << 4)   /**< SYSCLK divided by 16.      */
#define AT32_HPRE_DIV64        (12 << 4)   /**< SYSCLK divided by 64.      */
#define AT32_HPRE_DIV128       (13 << 4)   /**< SYSCLK divided by 128.     */
#define AT32_HPRE_DIV256       (14 << 4)   /**< SYSCLK divided by 256.     */
#define AT32_HPRE_DIV512       (15 << 4)   /**< SYSCLK divided by 512.     */

#define AT32_PPRE1_DIV1        (0 << 8)    /**< HCLK divided by 1.         */
#define AT32_PPRE1_DIV2        (4 << 8)    /**< HCLK divided by 2.         */
#define AT32_PPRE1_DIV4        (5 << 8)    /**< HCLK divided by 4.         */
#define AT32_PPRE1_DIV8        (6 << 8)    /**< HCLK divided by 8.         */
#define AT32_PPRE1_DIV16       (7 << 8)    /**< HCLK divided by 16.        */

#define AT32_PPRE2_DIV1        (0 << 11)   /**< HCLK divided by 1.         */
#define AT32_PPRE2_DIV2        (4 << 11)   /**< HCLK divided by 2.         */
#define AT32_PPRE2_DIV4        (5 << 11)   /**< HCLK divided by 4.         */
#define AT32_PPRE2_DIV8        (6 << 11)   /**< HCLK divided by 8.         */
#define AT32_PPRE2_DIV16       (7 << 11)   /**< HCLK divided by 16.        */

#define AT32_ADCPRE_DIV2       (0 << 14)   /**< PPRE2 divided by 2.        */
#define AT32_ADCPRE_DIV4       (1 << 14)   /**< PPRE2 divided by 4.        */
#define AT32_ADCPRE_DIV6       (2 << 14)   /**< PPRE2 divided by 6.        */
#define AT32_ADCPRE_DIV8       (3 << 14)   /**< PPRE2 divided by 8.        */
#define AT32_ADCPRE_DIV12      ((1<<28)|(1<<14))   /**< PPRE2 divided by 12.       */
#define AT32_ADCPRE_DIV16      ((1<<28)|(3<<14))   /**< PPRE2 divided by 16.       */

#define AT32_PLLSRC_HSI        (0 << 16)   /**< PLL clock source is HSI.   */
#define AT32_PLLSRC_HSE        (1 << 16)   /**< PLL clock source is HSE.   */

#define AT32_PLLXTPRE_DIV1     (0 << 17)   /**< HSE divided by 1.          */
#define AT32_PLLXTPRE_DIVX     (1 << 17)   /**< HSE divided by AT32_HSE_PRE_PLL_DIVx */

#define AT32_USBPRE_DIV1P5     (0 << 22)   /**< PLLOUT divided by 1.5.     */
#define AT32_USBPRE_DIV1       (1 << 22)   /**< PLLOUT divided by 1.       */
#define AT32_USBPRE_DIV2P5     (2 << 22)   /**< PLLOUT divided by 2.5.     */
#define AT32_USBPRE_DIV2       (3 << 22)   /**< PLLOUT divided by 2.       */

#define AT32_MCOSEL_NOCLOCK    (0 << 24)   /**< No clock on MCO pin.       */
#define AT32_MCOSEL_SYSCLK     (4 << 24)   /**< SYSCLK on MCO pin.         */
#define AT32_MCOSEL_HSI        (5 << 24)   /**< HSI clock on MCO pin.      */
#define AT32_MCOSEL_HSE        (6 << 24)   /**< HSE clock on MCO pin.      */
#define AT32_MCOSEL_PLLDIV2    (7 << 24)   /**< PLL/2 clock on MCO pin.    */
/** @} */

/**
 * @name    RCC_BDCR register bits definitions - RCC_BDC
 * @{
 */
#define AT32_RTCSEL_MASK       (3 << 8)    /**< RTC clock source mask.     */
#define AT32_RTCSEL_NOCLOCK    (0 << 8)    /**< No clock.                  */
#define AT32_RTCSEL_LSE        (1 << 8)    /**< LSE used as RTC clock.     */
#define AT32_RTCSEL_LSI        (2 << 8)    /**< LSI used as RTC clock.     */
#define AT32_RTCSEL_HSEDIV     (3 << 8)    /**< HSE divided by 128 used as
                                                 RTC clock.                 */
/** @} */

/**
 * @name    RCC_MISC Additional Register
 * @{
 */
#define AT32_HSISRC_DIV6      (0 << 25)    /**< HSI 6 divider enable 8MHz*/
#define AT32_HSISRC_DIV1      (1 << 25)    /**< HSI outputs undivided clock 48MHz */
                                           /**< sets HSI_DIV_EN=1  */

/**
 * @name    RCC_MISC2 Additional Register
 * @{
 */
#define AT32_USBSRC_PLL        (0 << 8)     /**< USB clock source is PLL or divider */
#define AT32_USBSRC_HSI        (1 << 8)     /**< USB clock source is HSI            */
                                            /**< HSI_DIV_EN=1 must be guaranteed>   */

#define AT32_HSI_SYS_CTRL_SEL0   (0 << 9)   /**< SCLK HSI source is 8MHz */
#define AT32_HSI_SYS_CTRL_SEL1   (1 << 9)   /**< SCLK HSI source is 48MHz or 8MHz   */
                                            /**< HSI_DIV_EN=1, 48MHz>   */

#define AT32_HSE_PRE_PLL_DIV2  (0 << 12)    /**< HSE clock divide by 2      */
#define AT32_HSE_PRE_PLL_DIV3  (1 << 12)    /**< HSE clock divide by 3      */
#define AT32_HSE_PRE_PLL_DIV4  (2 << 12)    /**< HSE clock divide by 4      */
#define AT32_HSE_PRE_PLL_DIV5  (3 << 12)    /**< HSE clock divide by 5      */
                                            /**< HSE_DIV_CTRL> */

/** @} */

/**
 * @name    Internal clock sources
 * @{
 */
#define AT32_HSICLK            48000000    /**< High speed internal clock. */
#define AT32_LSICLK            40000       /**< Low speed internal clock.  */
/** @} */

/**
 * @name    PWR_CR register bits definitions PWR_CTRL
 * @{
 */
#define AT32_PLS_MASK          (7 << 5)    /**< PLS bits mask.             */
#define AT32_PLS_LEV0          (0 << 5)    /**< PVD level 0.               */
#define AT32_PLS_LEV1          (1 << 5)    /**< PVD level 1.               */
#define AT32_PLS_LEV2          (2 << 5)    /**< PVD level 2.               */
#define AT32_PLS_LEV3          (3 << 5)    /**< PVD level 3.               */
#define AT32_PLS_LEV4          (4 << 5)    /**< PVD level 4.               */
#define AT32_PLS_LEV5          (5 << 5)    /**< PVD level 5.               */
#define AT32_PLS_LEV6          (6 << 5)    /**< PVD level 6.               */
#define AT32_PLS_LEV7          (7 << 5)    /**< PVD level 7.               */
/** @} */

/*===========================================================================*/
/* Platform capabilities.                                                    */
/*===========================================================================*/

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Disables the PWR/RCC initialization in the HAL.
 */
#if !defined(AT32_NO_INIT) || defined(__DOXYGEN__)
#define AT32_NO_INIT               FALSE
#endif

/**
 * @brief   Enables or disables the programmable voltage detector.
 */
#if !defined(AT32_PVD_ENABLE) || defined(__DOXYGEN__)
#define AT32_PVD_ENABLE            FALSE
#endif

/**
 * @brief   Sets voltage level for programmable voltage detector.
 */
#if !defined(AT32_PLS) || defined(__DOXYGEN__)
#define AT32_PLS                   AT32_PLS_LEV0
#endif

/**
 * @brief   Enables or disables the HSI clock source.
 */
#if !defined(AT32_HSI_ENABLED) || defined(__DOXYGEN__)
#define AT32_HSI_ENABLED           TRUE
#endif

/**
 * @brief   Enables or disables the LSI clock source.
 */
#if !defined(AT32_LSI_ENABLED) || defined(__DOXYGEN__)
#define AT32_LSI_ENABLED           FALSE
#endif

/**
 * @brief   Enables or disables the HSE clock source.
 */
#if !defined(AT32_HSE_ENABLED) || defined(__DOXYGEN__)
#define AT32_HSE_ENABLED           FALSE
#endif

/**
 * @brief   Enables or disables the LSE clock source.
 */
#if !defined(AT32_LSE_ENABLED) || defined(__DOXYGEN__)
#define AT32_LSE_ENABLED           FALSE
#endif
/** @} */

