Xelus22/ChibiOS-Contrib/os/hal/ports/AT32/AT32F403Axx/hal_lld.h
// TODO:

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   Main clock source selection.
 * @note    If the selected clock source is not the PLL then the PLL is not
 *          initialized and started.
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_SW) || defined(__DOXYGEN__)
#define AT32_SW                    AT32_SW_PLL
#endif

/**
 * @brief   Clock source for the PLL.
 * @note    This setting has only effect if the PLL is selected as the
 *          system clock source.
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_PLLSRC) || defined(__DOXYGEN__)
#define AT32_PLLSRC                AT32_PLLSRC_HSI
#endif

/**
 * @brief   Clock source to control HSI SYS CTRL
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_HSI_SYS_CTRL) || defined(__DOXYGEN__)
#define AT32_HSI_SYS_CTRL           AT32_HSI_SYS_CTRL_SEL1
#endif

/**
 * @brief   Clock source to control HSI DIV EN
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_HSISRC) || defined(__DOXYGEN__)
#define AT32_HSISRC           AT32_HSISRC_DIV1
#endif

/**
 * @brief   Clock source to control USB Clock Source
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_USBSRC) || defined(__DOXYGEN__)
#define AT32_USBSRC           AT32_USBSRC_HSI
#endif

/**
 * @brief   HSE Crystal divider
 * @note    This setting has only effect if the HSE is enabled
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_HSE_DIV) || defined(__DOXYGEN__)
#define AT32_HSE_DIV               AT32_HSE_PRE_PLL_DIV2
#endif

/**
 * @brief   Crystal PLL pre-divider.
 * @note    This setting has only effect if the PLL is selected as the
 *          system clock source.
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_PLLXTPRE) || defined(__DOXYGEN__)
#define AT32_PLLXTPRE              AT32_PLLXTPRE_DIV2
#endif

/**
 * @brief   PLL multiplier value.
 * @note    The allowed range is 2...16.
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_PLLMUL_VALUE) || defined(__DOXYGEN__)
#define AT32_PLLMUL_VALUE          60
#endif

/**
 * @brief   AHB prescaler value.
 * @note    The default value is calculated for a 240MHz system clock from
 *          a 48MHz HSI crystal using the PLL.
 */
#if !defined(AT32_HPRE) || defined(__DOXYGEN__)
#define AT32_HPRE                  AT32_HPRE_DIV1
#endif

/**
 * @brief   APB1 prescaler value.
 */
#if !defined(AT32_PPRE1) || defined(__DOXYGEN__)
#define AT32_PPRE1                 AT32_PPRE1_DIV2
#endif

/**
 * @brief   APB2 prescaler value.
 */
#if !defined(AT32_PPRE2) || defined(__DOXYGEN__)
#define AT32_PPRE2                 AT32_PPRE2_DIV2
#endif

/**
 * @brief   ADC prescaler value.
 */
#if !defined(AT32_ADCPRE) || defined(__DOXYGEN__)
#define AT32_ADCPRE                AT32_ADCPRE_DIV16
#endif

/**
 * @brief   USB clock setting.
 */
#if !defined(AT32_USB_CLOCK_REQUIRED) || defined(__DOXYGEN__)
#define AT32_USB_CLOCK_REQUIRED    TRUE
#endif

/**
 * @brief   USB prescaler initialization.
 */
#if !defined(AT32_USBPRE) || defined(__DOXYGEN__)
#define AT32_USBPRE                AT32_USBPRE_DIV1
#endif

/**
 * @brief   MCO pin setting.
 */
#if !defined(AT32_MCOSEL) || defined(__DOXYGEN__)
#define AT32_MCOSEL                AT32_MCOSEL_NOCLOCK
#endif

/**
 * @brief   RTC clock source.
 */
#if !defined(AT32_RTCSEL) || defined(__DOXYGEN__)
#define AT32_RTCSEL                AT32_RTCSEL_NOCLOCK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/
/*
 * Configuration-related checks.
 */
#if !defined(AT32F403A_MCUCONF)
#error "Using a wrong mcuconf.h file, AT32F403A_MCUCONF not defined"
#endif

/*
 * HSI related checks.
 */
#if AT32_HSI_ENABLED
#else /* !AT32_HSI_ENABLED */

#if AT32_SW == AT32_SW_HSI
#error "HSI not enabled, required by AT32_SW"
#endif

#if (AT32_SW == AT32_SW_PLL) && (AT32_PLLSRC == AT32_PLLSRC_HSI)
#error "HSI not enabled, required by AT32_SW and AT32_PLLSRC"
#endif

#if (AT32_MCOSEL == AT32_MCOSEL_HSI) ||                                   \
    ((AT32_MCOSEL == AT32_MCOSEL_PLLDIV2) &&                              \
     (AT32_PLLSRC == AT32_PLLSRC_HSI))
#error "HSI not enabled, required by AT32_MCOSEL"
#endif

#endif /* !AT32_HSI_ENABLED */

/*
 * HSE related checks.
 */
#if AT32_HSE_ENABLED

#if AT32_HSECLK == 0
#error "HSE frequency not defined"
#elif (AT32_HSECLK < AT32_HSECLK_MIN) || (AT32_HSECLK > AT32_HSECLK_MAX)
#error "AT32_HSECLK outside acceptable range (AT32_HSECLK_MIN...AT32_HSECLK_MAX)"
#endif

#else /* !AT32_HSE_ENABLED */

#if AT32_SW == AT32_SW_HSE
#error "HSE not enabled, required by AT32_SW"
#endif

#if (AT32_SW == AT32_SW_PLL) && (AT32_PLLSRC == AT32_PLLSRC_HSE)
#error "HSE not enabled, required by AT32_SW and AT32_PLLSRC"
#endif

#if (AT32_MCOSEL == AT32_MCOSEL_HSE) ||                                   \
    ((AT32_MCOSEL == AT32_MCOSEL_PLLDIV2) &&                              \
     (AT32_PLLSRC == AT32_PLLSRC_HSE))
#error "HSE not enabled, required by AT32_MCOSEL"
#endif

#if AT32_RTCSEL == AT32_RTCSEL_HSEDIV
#error "HSE not enabled, required by AT32_RTCSEL"
#endif

#endif /* !AT32_HSE_ENABLED */

