Xelus22/ChibiOS-Contrib/os/hal/ports/AT32/AT32F403Axx/hal_lld.h
/*
 * LSI related checks.
 */
#if AT32_LSI_ENABLED
#else /* !AT32_LSI_ENABLED */

#if HAL_USE_RTC && (AT32_RTCSEL == AT32_RTCSEL_LSI)
#error "LSI not enabled, required by AT32_RTCSEL"
#endif

#endif /* !AT32_LSI_ENABLED */

/*
 * LSE related checks.
 */
#if AT32_LSE_ENABLED

#if (AT32_LSECLK == 0)
#error "LSE frequency not defined"
#endif

#if (AT32_LSECLK < AT32_LSECLK_MIN) || (AT32_LSECLK > AT32_LSECLK_MAX)
#error "AT32_LSECLK outside acceptable range (AT32_LSECLK_MIN...AT32_LSECLK_MAX)"
#endif

#else /* !AT32_LSE_ENABLED */

#if AT32_RTCSEL == AT32_RTCSEL_LSE
#error "LSE not enabled, required by AT32_RTCSEL"
#endif

#endif /* !AT32_LSE_ENABLED */

/* PLL activation conditions.*/
#if AT32_USB_CLOCK_REQUIRED ||                                            \
    (AT32_SW == AT32_SW_PLL) ||                                           \
    (AT32_MCOSEL == AT32_MCOSEL_PLLDIV2) ||                               \
    defined(__DOXYGEN__)
/**
 * @brief   PLL activation flag.
 */
#define AT32_ACTIVATE_PLL          TRUE
#else
#define AT32_ACTIVATE_PLL          FALSE
#endif

/* HSE divider setting check.*/
#if (AT32_HSE_DIV != AT32_HSE_PRE_PLL_DIV2) &&                           \
    (AT32_HSE_DIV != AT32_HSE_PRE_PLL_DIV3) &&                           \
    (AT32_HSE_DIV != AT32_HSE_PRE_PLL_DIV4) &&                           \
    (AT32_HSE_DIV != AT32_HSE_PRE_PLL_DIV5)
#error "invalid AT32_PLLXTPRE value specified"
#endif

/* HSE prescaler setting check.*/
#if (AT32_PLLXTPRE != AT32_PLLXTPRE_DIV1) &&                           \
    (AT32_PLLXTPRE != AT32_PLLXTPRE_DIVX)
#error "invalid AT32_PLLXTPRE value specified"
#endif

/**
 * @brief   PLLMUL field.
 */
#if ((AT32_PLLMUL_VALUE >= 2) && (AT32_PLLMUL_VALUE <= 64)) ||            \
    defined(__DOXYGEN__)
#if (AT32_PLLMUL_VALUE <= 16)
#define AT32_PLLMUL                ((AT32_PLLMUL_VALUE - 2) << 18)
#else
#define AT32_PLLMUL                ((AT32_PLLMUL_VALUE - 1) << 18)
#endif
#else
#error "invalid AT32_PLLMUL_VALUE value specified"
#endif

/**
 * @brief   PLL input clock frequency.
 */
#if (AT32_PLLSRC == AT32_PLLSRC_HSE) || defined(__DOXYGEN__)
#if AT32_PLLXTPRE == AT32_PLLXTPRE_DIV1
#define AT32_PLLCLKIN              (AT32_HSECLK / 1)
#elif (AT32_PLLXTPRE == AT32_PLLXTPRE_DIVX) && (AT32_HSE_DIV == AT32_HSE_PRE_PLL_DIV2)
#define AT32_PLLCLKIN              (AT32_HSECLK / 2)
#elif (AT32_PLLXTPRE == AT32_PLLXTPRE_DIVX) && (AT32_HSE_DIV == AT32_HSE_PRE_PLL_DIV3)
#define AT32_PLLCLKIN              (AT32_HSECLK / 3)
#elif (AT32_PLLXTPRE == AT32_PLLXTPRE_DIVX) && (AT32_HSE_DIV == AT32_HSE_PRE_PLL_DIV4)
#define AT32_PLLCLKIN              (AT32_HSECLK / 4)
#elif (AT32_PLLXTPRE == AT32_PLLXTPRE_DIVX) && (AT32_HSE_DIV == AT32_HSE_PRE_PLL_DIV5)
#define AT32_PLLCLKIN              (AT32_HSECLK / 5)
#else
#error "invalid AT32_HSE_DIV value specified"
#endif
#elif AT32_PLLSRC == AT32_PLLSRC_HSI
#define AT32_PLLCLKIN              (AT32_HSICLK / 12)
#else
#error "invalid AT32_PLLSRC value specified"
#endif

/* PLL input frequency range check.*/
#if (AT32_PLLCLKIN < AT32_PLLIN_MIN) || (AT32_PLLCLKIN > AT32_PLLIN_MAX)
#error "AT32_PLLCLKIN outside acceptable range (AT32_PLLIN_MIN...AT32_PLLIN_MAX)"
#endif

/**
 * @brief   PLL output clock frequency.
 */
#define AT32_PLLCLKOUT             (AT32_PLLCLKIN * AT32_PLLMUL_VALUE)

/* PLL output frequency range check.*/
#if (AT32_PLLCLKOUT < AT32_PLLOUT_MIN) || (AT32_PLLCLKOUT > AT32_PLLOUT_MAX)
#error "AT32_PLLCLKOUT outside acceptable range (AT32_PLLOUT_MIN...AT32_PLLOUT_MAX)"
#endif

/**
 * @brief   HSI clock source out to Sys Clock
 * @note    Controlled by HSI_DIV_EN and HSI_SYS_CTRL
 */
#if (AT32_HSI_SYS_CTRL == AT32_HSI_SYS_CTRL_SEL1)
#if (AT32_HSISRC == AT32_HSISRC_DIV1)
#define AT32_HSI_SYS_CLK            AT32_HSICLK
#elif (AT32_HSISRC == AT32_HSISRC_DIV6)
#define AT32_HSI_SYS_CLK            (AT32_HSICLK / 6)
#else
#error "invalid AT32_HSISRC value specified"
#endif
#elif (AT32_HSI_SYS_CTRL == AT32_HSI_SYS_CTRL_SEL0)
#define AT32_HSI_SYS_CLK                (AT32_HSICLK / 6)
#else 
#error "invalid AT32_HSI_SYS_CTRL value specified"
#endif


/**
 * @brief   System clock source.
 */
#if (AT32_SW == AT32_SW_PLL) || defined(__DOXYGEN__)
#define AT32_SYSCLK                AT32_PLLCLKOUT
#elif (AT32_SW == AT32_SW_HSI)
#define AT32_SYSCLK                AT32_HSI_SYS_CLK
#elif (AT32_SW == AT32_SW_HSE)
#define AT32_SYSCLK                AT32_HSECLK
#else
#error "invalid AT32_SW value specified"
#endif

/* Check on the system clock.*/
#if AT32_SYSCLK > AT32_SYSCLK_MAX
#error "AT32_SYSCLK above maximum rated frequency (AT32_SYSCLK_MAX)"
#endif

/**
 * @brief   AHB frequency.
 */
#if (AT32_HPRE == AT32_HPRE_DIV1) || defined(__DOXYGEN__)
#define AT32_HCLK                  (AT32_SYSCLK / 1)
#elif AT32_HPRE == AT32_HPRE_DIV2
#define AT32_HCLK                  (AT32_SYSCLK / 2)
#elif AT32_HPRE == AT32_HPRE_DIV4
#define AT32_HCLK                  (AT32_SYSCLK / 4)
#elif AT32_HPRE == AT32_HPRE_DIV8
#define AT32_HCLK                  (AT32_SYSCLK / 8)
#elif AT32_HPRE == AT32_HPRE_DIV16
#define AT32_HCLK                  (AT32_SYSCLK / 16)
#elif AT32_HPRE == AT32_HPRE_DIV64
#define AT32_HCLK                  (AT32_SYSCLK / 64)
#elif AT32_HPRE == AT32_HPRE_DIV128
#define AT32_HCLK                  (AT32_SYSCLK / 128)
#elif AT32_HPRE == AT32_HPRE_DIV256
#define AT32_HCLK                  (AT32_SYSCLK / 256)
#elif AT32_HPRE == AT32_HPRE_DIV512
#define AT32_HCLK                  (AT32_SYSCLK / 512)
#else
#error "invalid AT32_HPRE value specified"
#endif

/* AHB frequency check.*/
#if AT32_HCLK > AT32_SYSCLK_MAX
#error "AT32_HCLK exceeding maximum frequency (AT32_SYSCLK_MAX)"
#endif

/**
 * @brief   APB1 frequency.
 */
#if (AT32_PPRE1 == AT32_PPRE1_DIV1) || defined(__DOXYGEN__)
#define AT32_PCLK1                 (AT32_HCLK / 1)
#elif AT32_PPRE1 == AT32_PPRE1_DIV2
#define AT32_PCLK1                 (AT32_HCLK / 2)
#elif AT32_PPRE1 == AT32_PPRE1_DIV4
#define AT32_PCLK1                 (AT32_HCLK / 4)
#elif AT32_PPRE1 == AT32_PPRE1_DIV8
#define AT32_PCLK1                 (AT32_HCLK / 8)
#elif AT32_PPRE1 == AT32_PPRE1_DIV16
#define AT32_PCLK1                 (AT32_HCLK / 16)
#else
#error "invalid AT32_PPRE1 value specified"
#endif

/* APB1 frequency check.*/
#if AT32_PCLK1 > AT32_PCLK1_MAX
#error "AT32_PCLK1 exceeding maximum frequency (AT32_PCLK1_MAX)"
#endif

/**
 * @brief   APB2 frequency.
 */
#if (AT32_PPRE2 == AT32_PPRE2_DIV1) || defined(__DOXYGEN__)
#define AT32_PCLK2                 (AT32_HCLK / 1)
#elif AT32_PPRE2 == AT32_PPRE2_DIV2
#define AT32_PCLK2                 (AT32_HCLK / 2)
#elif AT32_PPRE2 == AT32_PPRE2_DIV4
#define AT32_PCLK2                 (AT32_HCLK / 4)
#elif AT32_PPRE2 == AT32_PPRE2_DIV8
#define AT32_PCLK2                 (AT32_HCLK / 8)
#elif AT32_PPRE2 == AT32_PPRE2_DIV16
#define AT32_PCLK2                 (AT32_HCLK / 16)
#else
#error "invalid AT32_PPRE2 value specified"
#endif

/* APB2 frequency check.*/
#if AT32_PCLK2 > AT32_PCLK2_MAX
#error "AT32_PCLK2 exceeding maximum frequency (AT32_PCLK2_MAX)"
#endif

/**
 * @brief   RTC clock.
 */
#if (AT32_RTCSEL == AT32_RTCSEL_LSE) || defined(__DOXYGEN__)
#define AT32_RTCCLK                AT32_LSECLK
#elif AT32_RTCSEL == AT32_RTCSEL_LSI
#define AT32_RTCCLK                AT32_LSICLK
#elif AT32_RTCSEL == AT32_RTCSEL_HSEDIV
#define AT32_RTCCLK                (AT32_HSECLK / 128)
#elif AT32_RTCSEL == AT32_RTCSEL_NOCLOCK
#define AT32_RTCCLK                0
#else
#error "invalid source selected for RTC clock"
#endif

/**
 * @brief   ADC frequency.
 */
#if (AT32_ADCPRE == AT32_ADCPRE_DIV2) || defined(__DOXYGEN__)
#define AT32_ADCCLK                (AT32_PCLK2 / 2)
#elif AT32_ADCPRE == AT32_ADCPRE_DIV4
#define AT32_ADCCLK                (AT32_PCLK2 / 4)
#elif AT32_ADCPRE == AT32_ADCPRE_DIV6
#define AT32_ADCCLK                (AT32_PCLK2 / 6)
#elif AT32_ADCPRE == AT32_ADCPRE_DIV8
#define AT32_ADCCLK                (AT32_PCLK2 / 8)
#elif AT32_ADCPRE == AT32_ADCPRE_DIV12
#define AT32_ADCCLK                ((AT32_PCLK2 / 6) /2 )
#elif AT32_ADCPRE == AT32_ADCPRE_DIV16
#define AT32_ADCCLK                ((AT32_PCLK2 / 4) /4)
#else
#error "invalid AT32_ADCPRE value specified"
#endif

/* ADC frequency check.*/
#if AT32_ADCCLK > AT32_ADCCLK_MAX
#define XSTR(x) STR(x)
#define STR(x) #x
#pragma message "hsi sysclk" XSTR(AT32_HSI_SYS_CLK)
#pragma message "sysclk" XSTR(AT32_SYSCLK)
#pragma message "hclk" XSTR(AT32_HCLK)
#pragma message "pclk2" XSTR(AT32_PCLK2)
#pragma message "adcpre" XSTR(AT32_ADCPRE)
#pragma message "adcclk" XSTR(AT32_ADCCLK)
#pragma message "adcclkmax" XSTR(AT32_ADCCLK_MAX)
#error "AT32_ADCCLK exceeding maximum frequency (AT32_ADCCLK_MAX)"
#endif

/**
 * @brief   USB frequency.
 */
#if(AT32_USBSRC == AT32_USBSRC_HSI)
//checks
#if (AT32_HSISRC != AT32_HSISRC_DIV1)
#error "AT32_HSISRC must equal AT32_HSISRC_DIV1 if using HSI for USBSRC"
#else
#define AT32_USBCLK                AT32_HSICLK
#endif
#elif (AT32_USBSRC == AT32_USBSRC_PLL)
#if (AT32_USBPRE == AT32_USBPRE_DIV1P5) || defined(__DOXYGEN__)
#define AT32_USBCLK                ((AT32_PLLCLKOUT * 2) / 3)
#elif (AT32_USBPRE == AT32_USBPRE_DIV1)
#define AT32_USBCLK                AT32_PLLCLKOUT
#elif (AT32_USBPRE == AT32_USBPRE_DIV2P5)
#define AT32_USBCLK                ((AT32_PLLCLKOUT * 5) /2)
#elif (AT32_USBPRE == AT32_USBPRE_DIV2)
#define AT32_USBCLK                (AT32_PLLCLKOUT/2)
#else
#error "invalid AT32_USBPRE value specified"
#endif
#else
#error "invalid AT32_USBSRC value specified"
#endif

/**
 * @brief   Timers 2, 3, 4, 5, 6, 7, 12, 13, 14 clock.
 */
#if (AT32_PPRE1 == AT32_PPRE1_DIV1) || defined(__DOXYGEN__)
#define AT32_TIMCLK1               (AT32_PCLK1 * 1)
#else
#define AT32_TIMCLK1               (AT32_PCLK1 * 2)
#endif

/**
 * @brief   Timers 1, 8, 9, 10, 11 clock.
 */
#if (AT32_PPRE2 == AT32_PPRE2_DIV1) || defined(__DOXYGEN__)
#define AT32_TIMCLK2               (AT32_PCLK2 * 1)
#else
#define AT32_TIMCLK2               (AT32_PCLK2 * 2)
#endif

/** @} */
/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

/* Various helpers.*/
#include "nvic.h"
#include "cache.h"
#include "mpu_v7m.h"
#include "at32_isr.h"
#include "at32_dma.h"
#include "at32_rcc.h"
#include "at32_tim.h"

#ifdef __cplusplus
extern "C" {
#endif
  void hal_lld_init(void);
  void at32_clock_init(void);
#ifdef __cplusplus
}
#endif

#endif /* HAL_LLD_H */

/** @} */
